OpenFOAM/SiliconeSpread/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (0.0000 0.0000 0.0000)
    (0.0100 0.0000 0.0000)
    (0.0000 0.0050 0.0000)
    (0.0100 0.0050 0.0000)
    (0.0000 0.0000 0.0001)
    (0.0100 0.0000 0.0001)
    (0.0000 0.0050 0.0001)
    (0.0100 0.0050 0.0001)
    
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (200 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftAndRight
    {
        type wall;
        faces
        (
            (0 4 6 2)
            (5 1 3 7)
        );
    }   
    surface
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 3 2)
            (6 7 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
