OpenFOAM/SiliconeSpread/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.silicone 0
);

regions
(
    sphereToCell
    {
        centre (0.005 0.0005 0);
        radius  0.0005;
        fieldValues
        (
            volScalarFieldValue alpha.silicone 1
            volVectorFieldValue U (0 0 0)
        );
    }
);


// ************************************************************************* //
